{
  "general": {
    "displayName": "General/Misc commands",
    "menuName": "General/Misc",
    "commands": [
      {
        "aliases": "list",
        "description": "See who is online",
        "tags": [
          "players",
          "online"
        ]
      },
      {
        "aliases": "ontime",
        "description": "Check your platime stats",
        "tags": [
          "stats"
        ]
      },
      {
        "aliases": "ping",
        "description": "Check your ping time in ms!",
        "tags": [
          "ping",
          "lag"
        ]
      },
      {
        "aliases": "hat",
        "arguments": "<block>",
        "description": "Hat yourself with the block you gave! Only works in creative worlds!",
        "tags": [
          "fun"
        ]
      }
    ]
  },
  "tp": {
    "displayName": "Teleport commands",
    "menuName": "Teleport",
    "commands": [
      {
        "aliases": "call",
        "arguments": "<user>",
        "description": "Request to teleport **to** the specified player. Said player will have to then accept the teleport request for it to complete.",
        "tags": [
          "teleport",
          "tp"
        ]
      },
      {
        "aliases": [
          "bring",
          "tpa"
        ],
        "arguments": "<user>",
        "description": "Use this after someone has requested a teleport to you to accept and bring them to your position.",
        "tags": [
          "teleport",
          "tp",
          "bring",
          "tpa"
        ]
      },
      {
        "aliases": [
          "return",
          "back"
        ],
        "description": "Return to the last location before your last teleport.",
        "tags": [
          "teleport",
          "tp",
          "return",
          "back"
        ]
      }
    ]
  },
  "chat": {
    "displayName": "Chat commands",
    "menuName": "Chat",
    "commands": [
      {
        "aliases": [
          "msg",
          "message",
          "w",
          "pm",
          "t",
          "tell",
          "whisper"
        ],
        "arguments": "<target> <message...>",
        "description": "Private message a user.",
        "tags": [
          "chat",
          "pm",
          "reply",
          "msg"
        ]
      },
      {
        "aliases": [
          "r",
          "reply"
        ],
        "arguments": "<message...>",
        "description": "Shortcut command to reply to private messages. ",
        "tags": [
          "chat",
          "pm",
          "msg"
        ]
      },
      {
        "aliases": "me",
        "arguments": "<message..>",
        "description": "Send an action message.",
        "tags": [
          "chat",
          "action",
          "fun"
        ]
      }
    ]
  },
  "lwc": {
    "displayName": "LWC/Chest commands",
    "menuName": "LWC/Chest",
    "commands": [
      {
        "aliases": "cpublic",
        "description": "Creates a public protection. Anyone can use a Public protection, but no one can protect it.",
        "tags": [
          "lwc",
          "chest",
          "protection"
        ]
      },
      {
        "aliases": "cpassword",
        "description": "Password-protect a block. Each time you login you need to enter the password to access it. (if someone else knows the password, they can access it too.",
        "tags": [
          "lwc",
          "chest",
          "protection"
        ]
      },
      {
        "aliases": "cprivate",
        "description": "Create a private protection. Private means private: you can also allow other users or groups to access the block as well. This is done by adding them after \"private\". You can add more than one group and/or user per command. When you prefix a User or Group with an '@', this User/Group will be able to modify the block and add other users. They cannot disable the owner from modifying it.",
        "tags": [
          "lwc",
          "chest",
          "protection"
        ]
      },
      {
        "aliases": "cmodify",
        "description": "Modify an existing protection, adding or removing users and/or groups. See /lwc create, the example for private protections. The same syntax is used for this command. There's an additional prefix however. Writing a '-' infront of a User or Group removes the access from the block.",
        "tags": [
          "lwc",
          "chest",
          "protection"
        ]
      },
      {
        "aliases": "cunlock",
        "description": "Unlock a password-protected block.",
        "tags": [
          "lwc",
          "chest",
          "protection"
        ]
      },
      {
        "aliases": "cinfo",
        "description": "Punch a protection to view information on it.",
        "tags": [
          "lwc",
          "chest",
          "protection"
        ]
      },
      {
        "aliases": "cremove",
        "description": "Removes protection.",
        "tags": [
          "lwc",
          "chest",
          "protection"
        ]
      },
      {
        "aliases": "climits",
        "description": "View the amount of protections you are allowed.",
        "tags": [
          "lwc",
          "chest",
          "protection"
        ]
      },
      {
        "aliases": "lwc mode persist",
        "arguments": "<on|off>",
        "description": "Persistent mode will let you perform your last command on multiple blocks, untill you turn it off.",
        "tags": [
          "lwc",
          "chest",
          "protection"
        ]
      },
      {
        "aliases": "lwc mode droptransfer",
        "arguments": "<select|on|off|status>",
        "description": "Select: Select the chest drops go to. On: Enable droptransfers. Off: Disable droptransfers. Status: Display the status of the droptransfers. ",
        "tags": [
          "lwc",
          "chest",
          "protection"
        ]
      }
    ]
  },
  "homesweethome": {
    "displayName": "HomeSweetHome commands",
    "menuName": "HomeSweetHome",
    "isGroup": true,
    "description": "So finally we we have HomeSweetHome 2.0 (technically 2.1) on the server. So, what's special about this version of HSH, how do you use it, what cool features does it have, and so on. First off, for the most part, if you're used to the old HSH, then not much (if any) has changed in how you use the old features. If you only care about that, then everything will continue to work like it always has. For those that want to see what's new, and for those that don't know how to use HSH, read on.",
    "subgroups": {
      "hsh_basic": {
        "displayName": "Basic usage",
        "menuName": "HSH basics",
        "description": "First off, let's go over the basics, like how to set a home, and then teleport to that home, delete it, and see the list of all, homes, in addition to going over the interface.",
        "commands": [
          {
            "aliases": "home set",
            "arguments": "<homeName>",
            "description": "Use this command to set some home at your current location with `homeName` as it's name. Note that `homeName` can have spaces in it. For this reason, the home name for commands is ALWAYS the last argument. If you already have a home named `homeName`, then it will move that home to your new location.",
            "tags": [
              "home",
              "sethome"
            ]
          },
          {
            "aliases": "home",
            "arguments": "[homeName]",
            "description": "Use this command to actually go to your home. You can autocomplete by using tab. If you do not specify a home, it will bring up the home interface (`/home list`).",
            "tags": [
              "home"
            ]
          },
          {
            "aliases": "home delete",
            "arguments": "<homeName>",
            "description": "Use this command to delete a home. Note that this is not reversible.",
            "tags": [
              "home",
              "delete",
              "deletehome",
              "removehome"
            ]
          },
          {
            "aliases": [
              "home list",
              "homes",
              "home"
            ],
            "arguments": "<homeName>",
            "description": "Use this command to view your current homes. Here is however one of the major things that separate HSH 2.x from both other home plugins and HSH 1.x. While you would expect to just see your homes when you use that, and that is true, but you also get a lot more information and buttons. Buttons in HSH are things that you can click on and that suggests commands to you.\n\n![HSH interface](assets/images/commands/hsh_interface.jpg)\n\nThe first line here tells you how many homes you can have in total, you can also get this information from the `/home limit` command. On the next line is a button create a new home. You just have to replace `<homeName>` with the desired name.\n\nNext are the home list itself, in addition to buttons for teleporting to the home, moving it, inviting someone to it (more on invites later), bringing up residents interface (more on residents later), and finally a button to delete the home.\n\n\nIf there is something you don't quite remember how to do, you can most likely use the home interface to do it.",
            "tags": [
              "home",
              "homes",
              "listhomes"
            ]
          }
        ]
      },
      "hsh_invites": {
        "displayName": "Invites",
        "menuName": "HSH invites",
        "description": "HSH also features invites and requests. Invites is something that the home owner can send to other players, so that they get a one time ticket to that home for a limited amount of time. Requests are the opposite. They allow a normal player to ask to be allowed to go to another player's home. Note that tab complete does not work for these commands (that would allow you to see another persons homes, even though they might not want that). Both invites (unless you are a resident, more bellow) and requests can only be used when the home owner is online.",
        "commands": [
          {
            "aliases": "home invite",
            "arguments": "<player> <home>",
            "description": "Use this to invite another player to your home. Once they use the invite, they need to get a new one before they can go to the home again.",
            "tags": [
              "home",
              "invite"
            ]
          },
          {
            "aliases": "home goto",
            "arguments": "<user> <home>",
            "description": "This command has two specific meanings, depending on if you have been invited to that home or not.\n\n\nIf you already have been invited to that home, you will teleport to that home, and the invite will be used up.\n\nIf you have not been invited to the home before, you instead send a request to the player for that specific home. You then have to wait for the request to be accepted. You can only have one request for each player (Meaning that if you did `/home goto Clownpiece_ HakureiNew`, followed by `/home goto Clownpiece_ HumanNew`, the request for `HakureiNew`, would no longer be valid).",
            "tags": [
              "home",
              "invite",
              "goto",
              "request"
            ]
          },
          {
            "aliases": "home accept",
            "arguments": "<player>",
            "description": "If you have received a request from a player, you can use this to accept the request. Once you do they will be teleported to the home.",
            "tags": [
              "home",
              "accept"
            ]
          }
        ]
      },
      "hsh_residents": {
        "displayName": "Residents",
        "menuName": "HSH residents",
        "description": "Both invites and requests are a one time thing. They can't be reused. What if you have a home that has multiple people living in it? Residents solve this problem, they are like a permanent invite to a home that can also be used when the home owner is offline. For the players that are residents of the home, they use the goto command just like as if it was another invite.",
        "commands": [
          {
            "aliases": "home residents",
            "arguments": "[home]",
            "description": "Residents also have a seperate interface similar to the home interface. If you do not specify a home name, you get a overview of all of your homes and their residents. If you specify a home, you get a list off all the residents in that home, in addition to buttons to manipulate this info.",
            "tags": [
              "home",
              "residents"
            ]
          },
          {
            "aliases": "home residents add",
            "arguments": "<home> <player>",
            "description": "Add a player as a resident to a home",
            "tags": [
              "home",
              "residents",
              "addresident"
            ]
          },
          {
            "aliases": "home residents remove",
            "arguments": "<home> <player>",
            "description": "Remove a player as a resident from a home",
            "tags": [
              "home",
              "residents",
              "removeresident"
            ]
          }
        ]
      }
    }
  }
}